prod-deploy/results/prod-02-2-p1-baseline-20260722/round-1-stable/round-1/layout-A2/fio.txt
storage_test: (g=0): rw=write, bs=(R) 4096KiB-4096KiB, (W) 4096KiB-4096KiB, (T) 4096KiB-4096KiB, ioengine=libaio, iodepth=128
...
fio-3.28
Starting 128 processes
storage_test: Laying out IO file (1 file / 1024MiB)
storage_test: Laying out IO file (1 file / 1024MiB)
storage_test: Laying out IO file (1 file / 1024MiB)
[...]

storage_test: (groupid=0, jobs=128): err= 0: pid=1231288: Thu Jul 23 10:30:56 2026
  write: IOPS=1035, BW=4141MiB/s (4342MB/s)(128GiB/31651msec); 0 zone resets
    slat (usec): min=1851, max=242778, avg=120563.11, stdev=35635.14
    clat (usec): min=2, max=17341k, avg=11432111.73, stdev=5181043.40
     lat (msec): min=2, max=17503, avg=11552.68, stdev=5184.55
    clat percentiles (msec):
     |  1.00th=[  108],  5.00th=[ 1062], 10.00th=[ 2635], 20.00th=[ 5805],
     | 30.00th=[ 8926], 40.00th=[12013], 50.00th=[14429], 60.00th=[15100],
     | 70.00th=[15368], 80.00th=[15637], 90.00th=[16040], 95.00th=[16174],
     | 99.00th=[16576], 99.50th=[16711], 99.90th=[17113], 99.95th=[17113],
     | 99.99th=[17113]
   bw (  MiB/s): min= 2154, max= 5729, per=98.71%, avg=4087.85, stdev= 6.47, samples=1954
   iops        : min=  535, max= 1835, avg=1030.15, stdev= 1.99, samples=3896
  lat (usec)   : 4=0.04%, 10=0.34%, 20=0.01%
  lat (msec)   : 4=0.02%, 10=0.01%, 20=0.05%, 50=0.16%, 100=0.34%
  lat (msec)   : 250=0.86%, 500=1.11%, 750=0.99%, 1000=0.87%, 2000=3.20%
  lat (msec)   : >=2000=92.00%
  cpu          : usr=0.24%, sys=0.21%, ctx=1049461, majf=2, minf=2209
  IO depths    : 1=0.4%, 2=0.8%, 4=1.6%, 8=3.1%, 16=6.2%, 32=12.5%, >=64=75.4%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=99.2%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.8%
     issued rwts: total=0,32768,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
  WRITE: bw=4141MiB/s (4342MB/s), 4141MiB/s-4141MiB/s (4342MB/s-4342MB/s), io=128GiB (137GB), run=31651-31651msec